{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "admission_requirements",
      "patterns": [
        "What are the admission requirements?",
        "Can you tell me about the admission process?",
        "What documents are needed for admission?",
        "Requirements for admission to IFSU",
        "IFSU entrance requirements"
      ],
      "responses": [
        "General Admission Requirements<br><br>Incoming First-Year Students – Baccalaureate<br><br>- IFSU Entrance Exam Result (original)<br>- Senior High School Report Card (Form 138-A -original)<br>- Certificate of Good Moral Character from the last school attended (original)<br>- One 3.5 cm x 5 cm (passport size) recent (taken within the last 6 months) colored ID picture with white background and name tag<br>- PSA or NSO issued Birth Certificate (photocopy)<br>- PSA or NSO issued Marriage Certificate (photocopy) – for married applicants<br><br>Incoming Transferees – Baccalaureate<br><br>- IFSU Entrance Exam Result (original)<br>- Transfer Credential or Honorable Dismissal (from last school attended – original)<br>- True Copy of Grades or Certified Photocopy of Transcript of Records (from last school attended)<br>- Certificate of Good Moral Character from the last school attended (original)<br>- One 3.5 cm x 4.5 cm (passport size) recent (taken within the last 6 months) colored ID picture with white background and name tag<br>- PSA or NSO issued Birth Certificate (photocopy)<br>- PSA or NSO issued Marriage Certificate (photocopy) – for married applicants<br><br>College of Advanced Education (Graduate School) – All Incoming Applicants<br><br>- Transfer Credential or Honorable Dismissal (from last school attended – original)<br>- True Copy of Grades or Certified Photocopy of Transcript of Records (from last school attended)<br>- One 3.5 cm x 5 cm (passport size) recent (taken within the last 6 months) colored ID picture with white background and name tag<br>- PSA or NSO issued Birth Certificate (photocopy)<br>- PSA or NSO issued Marriage Certificate (photocopy) – for married applicants<br><br>Notes:<br>- Form 137A (Senior High School Transcript) or College Official Transcript of Records will be sent by the last school attended upon our request.<br>- Foreign applicants must also present a student visa in addition to the above requirements."
      ]
    },
    {
      "tag": "programs_courses_general",
      "patterns": [
        "What courses does IFSU offer?",
        "Can you list the programs provided by IFSU?",
        "What are the available programs at IFSU?",
        "Programs in IFSU",
        "Available programs in IFSU",
        "Courses in IFSU",
        "What programs does IFSU offer?"
      ],
      "responses": [
        "IFSU offers a variety of programs across multiple campuses, including undergraduate and graduate courses. Can you specify which campus or degree you are interested in for more detailed information?"
      ]
    },    
    {
      "tag": "programs_courses_lamut_graduate",
      "patterns": [
        "What are the graduate programs offered in Lamut Campus?",
        "What doctorate and master’s degrees are available in Lamut?",
        "Graduate studies at Lamut campus?"
      ],
      "responses": [
        "LAMUT CAMPUS - GRADUATE STUDIES<br><br>COLLEGE OF ADVANCED EDUCATION<br><br>Doctorate Degree Programs:<br>- Doctor of Philosophy in Education Management<br>- Doctor of Philosophy in Management<br><br>Master’s Degree Programs:<br>- Master in Public Administration<br>- Master of Arts in Educational Management<br>- Master of Arts in Special Education<br>- Master of Arts in Nursing, major in Nursing Services Administration<br>- Master of Arts in Nursing, major in Maternal and Child Health<br>- Master of Arts in Early Childhood Education<br>- Master of Arts in Teaching English<br>- Master of Arts in Teaching Filipino<br>- Master of Arts in Teaching Mathematics<br>- Master of Arts in Teaching Science<br>- Master of Arts in Criminal Justice with Specialization in Criminology"
      ]
    },
    {
      "tag": "programs_courses_lamut_undergraduate",
      "patterns": [
        "What undergraduate programs are offered in Lamut Campus?",
        "What are the bachelor’s degrees available at Lamut?",
        "Undergraduate studies at Lamut campus?"
      ],
      "responses": [
        "LAMUT CAMPUS - UNDERGRADUATE STUDIES<br><br>COLLEGE OF AGRICULTURE AND SUSTAINABLE DEVELOPMENT<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Agriculture, major in: Agricultural Extension, Animal Science, and Crop Science<br>- Bachelor in Agricultural Technology, major in: Animal Technology and Crop Technology<br>- Bachelor of Science in Forestry<br>- Bachelor of Science in Home Technology, major in: Clothing and Foods<br><br>Pre-Baccalaureate Programs:<br>- Diploma in Agricultural Technology<br><br>COLLEGE OF ARTS AND SCIENCES<br>- Bachelor of Arts in Political Science<br>- Bachelor of Science in Psychology<br>- Bachelor of Science in Tourism Management<br>- Bachelor of Science in Social Work<br><br>COLLEGE OF CRIMINAL JUSTICE EDUCATION<br>- Bachelor of Science in Criminology<br><br>COLLEGE OF COMPUTING SCIENCES<br>- Bachelor of Science in Information Technology<br><br>Pre-Baccalaureate Programs:<br>- Associate in Computer Technology<br><br>COLLEGE OF EDUCATION<br><br>Baccalaureate Programs:<br>- Bachelor of Elementary Education<br>- Bachelor of Secondary Education, major in: English, Filipino, Mathematics, and Social Studies<br>- Bachelor of Physical Education<br>- Bachelor in Early Childhood Education<br><br>Post-Baccalaureate Programs:<br>- Diploma in Teacher Education"
      ]
    },
    {
      "tag": "programs_courses_lagawe",
      "patterns": [
        "What programs are available at Lagawe Campus?",
        "Graduate and undergraduate courses in Lagawe?",
        "What degrees can I take at Lagawe campus?"
      ],
      "responses": [
        "LAGAWE CAMPUS<br><br>GRADUATE STUDIES<br><br>COLLEGE OF BUSINESS AND MANAGEMENT<br><br>Doctorate Degree Programs:<br>- Doctor of Business Administration<br><br>Master’s Degree Programs:<br>- Master in Business Administration<br><br>COLLEGE OF EDUCATION<br><br>Master’s Degree Programs:<br>- Master of Arts in Technology and Livelihood Education, major in: Home Economics, Industrial Arts Technology, and Information and Communications Technology<br><br>UNDERGRADUATE STUDIES<br><br>COLLEGE OF BUSINESS AND MANAGEMENT<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Accountancy<br>- Bachelor of Science in Business Administration, major in: Financial Management and Marketing Management<br>- Bachelor of Science in Tourism Management<br>- Bachelor of Science in Hospitality Management<br><br>COLLEGE OF ENGINEERING AND TECHNOLOGY<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Civil Engineering<br>- Bachelor of Science in Computer Engineering<br>- Bachelor of Science in Industrial Technology, major in: Automotive Technology, Civil Technology, and Garment Technology<br>- Bachelor of Science in Electrical Engineering<br>- Bachelor of Science in Mechanical Engineering<br><br>COLLEGE OF EDUCATION<br><br>Baccalaureate Programs:<br>- Bachelor of Elementary Education<br>- Bachelor of Secondary Education, major in: English<br>- Bachelor of Technology and Livelihood Education<br>- Bachelor of Technical Vocational Teacher Education, major in: Garment and Fashion Design, Electrical Technology, and Welding and Fabrication Technology<br><br>Post-Baccalaureate Programs:<br>- Diploma in Teacher Education"
      ]
    },
    {
      "tag": "programs_courses_potia",
      "patterns": [
        "What programs are available at Potia Campus?",
        "Graduate and undergraduate courses in Potia?",
        "What degrees can I take at Potia campus?"
      ],
      "responses": [
        "POTIA CAMPUS<br><br>GRADUATE STUDIES<br><br>COLLEGE OF ADVANCED EDUCATION<br><br>Master’s Degree Programs:<br>- Master in Public Administration<br>- Master of Arts in Educational Management<br>- Master of Arts in Teaching English<br>- Master of Arts in Teaching Filipino<br>- Master of Arts in Teaching Mathematics<br>- Master of Arts in Teaching Science<br>- Master of Arts in Technology and Livelihood Education, major in: Agritech and Fishery Arts, Home Economics, Industrial Arts Technology, and Information and Communication Technology<br>- Master of Science in Agriculture, major in: Animal Science and Crop Science<br><br>UNDERGRADUATE STUDIES<br><br>COLLEGE OF EDUCATION<br><br>Baccalaureate Programs:<br>- Bachelor of Elementary Education<br>- Bachelor of Secondary Education, major in: English, Filipino, Mathematics, and Science<br>- Bachelor of Technology and Livelihood Education<br>- Bachelor of Early Childhood Education<br>- Bachelor of Physical Education<br><br>COLLEGE OF AGRICULTURE AND SUSTAINABLE DEVELOPMENT<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Agriculture, major in: Animal Science and Crop Science<br>- Bachelor of Science in Forestry<br><br>COLLEGE OF ENGINEERING AND TECHNOLOGY<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Information Technology<br>- Bachelor of Science in Computer Engineering<br><br>COLLEGE OF CRIMINAL JUSTICE EDUCATION<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Criminology<br><br>COLLEGE OF BUSINESS AND MANAGEMENT<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Entrepreneurship<br>- Bachelor of Science in Hospitality Management<br><br>Pre-Baccalaureate Programs:<br>- Seafarer Rating Course<br><br>DEPARTMENT OF HEALTH SCIENCES<br><br>Pre-Baccalaureate Programs:<br>- Diploma in Midwifery"
      ]
    },
    {
      "tag": "scholarship_info",
      "patterns": [
        "What is the IFSU Scholarship?",
        "Tell me about the Scholarship and Financial Assistance Section.",
        "What is RA 10931?",
        "What are the programs under RA 10931?",
        "What does the Scholarship program offer?",
        "Who is implementing RA 10931?",
        "What is UniFAST?"
      ],
      "responses": [
        "The IFSU Scholarship and Financial Assistance Section coordinates with CHED for implementing RA 10931, known as the Universal Access to Quality Tertiary Education Act. It supports students through programs such as Free Higher Education, Free TVET, TES, and the Student Loan Program.",
        "RA 10931 is a law that ensures all Filipino students have access to quality tertiary education. It supports programs like Free Higher Education and various subsidies to make education more accessible."
      ]
    },
    {
      "tag": "program_details",
      "patterns": [
        "What are the four programs under RA 10931?",
        "Explain Free Higher Education.",
        "What is Free TVET?",
        "Tell me about the Tertiary Education Subsidy (TES).",
        "What is the Student Loan Program (SLP)?"
      ],
      "responses": [
        "The four programs under RA 10931 are:<br> 1. Free Higher Education: Tuition and miscellaneous fees covered for students in their first undergraduate degree.<br> 2. Free TVET: Free training and related expenses for first post-secondary TESDA-registered TVET learners.<br> 3. Tertiary Education Subsidy (TES): Covers tuition and educational expenses for undergraduate students.<br> 4. Student Loan Program (SLP): Short-term loans for covering expenses in undergraduate and graduate programs."
      ]
    },
    {
      "tag": "eligibility_requirements",
      "patterns": [
        "Who is eligible for the Free Higher Education?",
        "What are the eligibility criteria for Free TVET?",
        "Who can apply for the Tertiary Education Subsidy?",
        "What are the requirements for the Student Loan Program?"
      ],
      "responses": [
        "Eligibility for the Free Higher Education program includes students enrolled in their first undergraduate degree who meet admission and retention policies. Free TVET is for learners not holding a National Certificate III or higher. The TES is for undergraduate students enrolled in SUCs, LUCs, and other recognized institutions. The SLP is available for students in SUCs, LUCs, quality-assured private HEIs, and TVIs.",
        "To qualify for financial assistance, applicants must be Filipino citizens, not hold a degree, meet specific academic performance (e.g., GWA requirements), and meet an income cap of Php 300,000 per year."
      ]
    },
    {
      "tag": "application_requirements",
      "patterns": [
        "What are the documentary requirements for the scholarship?",
        "What documents are needed for application?",
        "What academic records are required for the scholarship?"
      ],
      "responses": [
        "The application requirements include:<br> 1. Academic records such as certified grades for incoming freshmen or certificate of grades for college applicants.<br> 2. Proof of income such as ITR, Tax Exemption Certificate, Certificate of Indigency, or Affidavit of No Income.<br> 3. Certificate of Good Moral Character.<br> 4. Additional documents may include ALS and PEPT certificates if applicable."
      ]
    },
    {
      "tag": "financial_benefits",
      "patterns": [
        "What is the financial assistance amount for each program?",
        "How much does the Scholarship provide per academic year?",
        "What are the benefits of the Tulong Dunong Grant?"
      ],
      "responses": [
        "The financial benefits per academic year are:<br> 1. Scholarship: SSP - Php 30,000.00, PESFA - Php 15,000.00.<br> 2. Tulong Dunong: Varies based on tuition, with amounts up to Php 12,000.00 per year.",
        "The financial benefits include coverage of tuition, other school fees, and additional expenses, as needed for each program."
      ]
    },
    {
      "tag": "priority_courses",
      "patterns": [
        "What are the priority courses for scholarships?",
        "List the priority courses for AY 2014-2015.",
        "What courses are included in the CHED priority list?"
      ],
      "responses": [
        "Priority courses include:<br> - Information Technology, Engineering, Health Sciences, Agriculture, Education, Arts, Social Sciences, Business Administration, and others as outlined by CHED. Specific examples are Computer Science, Engineering disciplines, Pharmacy, and Teacher Education subjects."
      ]
    }
  ]
}
