{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
        ],
        "responses": [
          "Hey",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
      {
        "tag": "admission_requirements",
        "patterns": [
          "What are the admission requirements?",
          "Can you tell me about the admission process?",
          "What documents are needed for admission?",
          "Requirements for admission to IFSU",
          "IFSU entrance requirements"
        ],
        "responses": [
          "General Admission Requirements<br><br>Incoming First-Year Students – Baccalaureate<br><br>- IFSU Entrance Exam Result (original)<br>- Senior High School Report Card (Form 138-A -original)<br>- Certificate of Good Moral Character from the last school attended (original)<br>- One 3.5 cm x 5 cm (passport size) recent (taken within the last 6 months) colored ID picture with white background and name tag<br>- PSA or NSO issued Birth Certificate (photocopy)<br>- PSA or NSO issued Marriage Certificate (photocopy) – for married applicants<br><br>Incoming Transferees – Baccalaureate<br><br>- IFSU Entrance Exam Result (original)<br>- Transfer Credential or Honorable Dismissal (from last school attended – original)<br>- True Copy of Grades or Certified Photocopy of Transcript of Records (from last school attended)<br>- Certificate of Good Moral Character from the last school attended (original)<br>- One 3.5 cm x 4.5 cm (passport size) recent (taken within the last 6 months) colored ID picture with white background and name tag<br>- PSA or NSO issued Birth Certificate (photocopy)<br>- PSA or NSO issued Marriage Certificate (photocopy) – for married applicants<br><br>College of Advanced Education (Graduate School) – All Incoming Applicants<br><br>- Transfer Credential or Honorable Dismissal (from last school attended – original)<br>- True Copy of Grades or Certified Photocopy of Transcript of Records (from last school attended)<br>- One 3.5 cm x 5 cm (passport size) recent (taken within the last 6 months) colored ID picture with white background and name tag<br>- PSA or NSO issued Birth Certificate (photocopy)<br>- PSA or NSO issued Marriage Certificate (photocopy) – for married applicants<br><br>Notes:<br>- Form 137A (Senior High School Transcript) or College Official Transcript of Records will be sent by the last school attended upon our request.<br>- Foreign applicants must also present a student visa in addition to the above requirements."
        ]
      },
      {
        "tag": "programs_courses_general",
        "patterns": [
          "What courses does IFSU offer?",
          "Can you list the programs provided by IFSU?",
          "What are the available programs at IFSU?",
          "Programs in IFSU",
          "Available programs in IFSU",
          "Courses in IFSU",
          "What programs does IFSU offer?"
        ],
        "responses": [
          "IFSU offers a variety of programs across multiple campuses, including undergraduate and graduate courses. Can you specify which campus or degree you are interested in for more detailed information?"
        ]
      },    
      {
        "tag": "programs_courses_lamut_graduate",
        "patterns": [
          "What are the graduate programs offered in Lamut Campus?",
          "What doctorate and master’s degrees are available in Lamut?",
          "Graduate studies at Lamut campus?"
        ],
        "responses": [
          "LAMUT CAMPUS - GRADUATE STUDIES<br><br>COLLEGE OF ADVANCED EDUCATION<br><br>Doctorate Degree Programs:<br>- Doctor of Philosophy in Education Management<br>- Doctor of Philosophy in Management<br><br>Master’s Degree Programs:<br>- Master in Public Administration<br>- Master of Arts in Educational Management<br>- Master of Arts in Special Education<br>- Master of Arts in Nursing, major in Nursing Services Administration<br>- Master of Arts in Nursing, major in Maternal and Child Health<br>- Master of Arts in Early Childhood Education<br>- Master of Arts in Teaching English<br>- Master of Arts in Teaching Filipino<br>- Master of Arts in Teaching Mathematics<br>- Master of Arts in Teaching Science<br>- Master of Arts in Criminal Justice with Specialization in Criminology"
        ]
      },
      {
        "tag": "programs_courses_lamut_undergraduate",
        "patterns": [
          "What undergraduate programs are offered in Lamut Campus?",
          "What are the bachelor’s degrees available at Lamut?",
          "Undergraduate studies at Lamut campus?"
        ],
        "responses": [
          "LAMUT CAMPUS - UNDERGRADUATE STUDIES<br><br>COLLEGE OF AGRICULTURE AND SUSTAINABLE DEVELOPMENT<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Agriculture, major in: Agricultural Extension, Animal Science, and Crop Science<br>- Bachelor in Agricultural Technology, major in: Animal Technology and Crop Technology<br>- Bachelor of Science in Forestry<br>- Bachelor of Science in Home Technology, major in: Clothing and Foods<br><br>Pre-Baccalaureate Programs:<br>- Diploma in Agricultural Technology<br><br>COLLEGE OF ARTS AND SCIENCES<br>- Bachelor of Arts in Political Science<br>- Bachelor of Science in Psychology<br>- Bachelor of Science in Tourism Management<br>- Bachelor of Science in Social Work<br><br>COLLEGE OF CRIMINAL JUSTICE EDUCATION<br>- Bachelor of Science in Criminology<br><br>COLLEGE OF COMPUTING SCIENCES<br>- Bachelor of Science in Information Technology<br><br>Pre-Baccalaureate Programs:<br>- Associate in Computer Technology<br><br>COLLEGE OF EDUCATION<br><br>Baccalaureate Programs:<br>- Bachelor of Elementary Education<br>- Bachelor of Secondary Education, major in: English, Filipino, Mathematics, and Social Studies<br>- Bachelor of Physical Education<br>- Bachelor in Early Childhood Education<br><br>Post-Baccalaureate Programs:<br>- Diploma in Teacher Education"
        ]
      },
      {
        "tag": "programs_courses_lagawe",
        "patterns": [
          "What programs are available at Lagawe Campus?",
          "Graduate and undergraduate courses in Lagawe?",
          "What degrees can I take at Lagawe campus?"
        ],
        "responses": [
          "LAGAWE CAMPUS<br><br>GRADUATE STUDIES<br><br>COLLEGE OF BUSINESS AND MANAGEMENT<br><br>Doctorate Degree Programs:<br>- Doctor of Business Administration<br><br>Master’s Degree Programs:<br>- Master in Business Administration<br><br>COLLEGE OF EDUCATION<br><br>Master’s Degree Programs:<br>- Master of Arts in Technology and Livelihood Education, major in: Home Economics, Industrial Arts Technology, and Information and Communications Technology<br><br>UNDERGRADUATE STUDIES<br><br>COLLEGE OF BUSINESS AND MANAGEMENT<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Accountancy<br>- Bachelor of Science in Business Administration, major in: Financial Management and Marketing Management<br>- Bachelor of Science in Tourism Management<br>- Bachelor of Science in Hospitality Management<br><br>COLLEGE OF ENGINEERING AND TECHNOLOGY<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Civil Engineering<br>- Bachelor of Science in Computer Engineering<br>- Bachelor of Science in Industrial Technology, major in: Automotive Technology, Civil Technology, and Garment Technology<br>- Bachelor of Science in Electrical Engineering<br>- Bachelor of Science in Mechanical Engineering<br><br>COLLEGE OF EDUCATION<br><br>Baccalaureate Programs:<br>- Bachelor of Elementary Education<br>- Bachelor of Secondary Education, major in: English<br>- Bachelor of Technology and Livelihood Education<br>- Bachelor of Technical Vocational Teacher Education, major in: Garment and Fashion Design, Electrical Technology, and Welding and Fabrication Technology<br><br>Post-Baccalaureate Programs:<br>- Diploma in Teacher Education"
        ]
      },
      {
        "tag": "programs_courses_potia",
        "patterns": [
          "What programs are available at Potia Campus?",
          "Graduate and undergraduate courses in Potia?",
          "What degrees can I take at Potia campus?"
        ],
        "responses": [
          "POTIA CAMPUS<br><br>GRADUATE STUDIES<br><br>COLLEGE OF ADVANCED EDUCATION<br><br>Master’s Degree Programs:<br>- Master in Public Administration<br>- Master of Arts in Educational Management<br>- Master of Arts in Teaching English<br>- Master of Arts in Teaching Filipino<br>- Master of Arts in Teaching Mathematics<br>- Master of Arts in Teaching Science<br>- Master of Arts in Technology and Livelihood Education, major in: Agritech and Fishery Arts, Home Economics, Industrial Arts Technology, and Information and Communication Technology<br>- Master of Science in Agriculture, major in: Animal Science and Crop Science<br><br>UNDERGRADUATE STUDIES<br><br>COLLEGE OF EDUCATION<br><br>Baccalaureate Programs:<br>- Bachelor of Elementary Education<br>- Bachelor of Secondary Education, major in: English, Filipino, Mathematics, and Science<br>- Bachelor of Technology and Livelihood Education<br>- Bachelor of Early Childhood Education<br>- Bachelor of Physical Education<br><br>COLLEGE OF AGRICULTURE AND SUSTAINABLE DEVELOPMENT<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Agriculture, major in: Animal Science and Crop Science<br>- Bachelor of Science in Forestry<br><br>COLLEGE OF ENGINEERING AND TECHNOLOGY<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Information Technology<br>- Bachelor of Science in Computer Engineering<br><br>COLLEGE OF CRIMINAL JUSTICE EDUCATION<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Criminology<br><br>COLLEGE OF BUSINESS AND MANAGEMENT<br><br>Baccalaureate Programs:<br>- Bachelor of Science in Entrepreneurship<br>- Bachelor of Science in Hospitality Management<br><br>Pre-Baccalaureate Programs:<br>- Seafarer Rating Course<br><br>DEPARTMENT OF HEALTH SCIENCES<br><br>Pre-Baccalaureate Programs:<br>- Diploma in Midwifery"
        ]
      },
      {
        "tag": "scholarship_info",
        "patterns": [
          "What is the IFSU Scholarship?",
          "Tell me about the Scholarship and Financial Assistance Section.",
          "What is RA 10931?",
          "What are the programs under RA 10931?",
          "What does the Scholarship program offer?",
          "Who is implementing RA 10931?",
          "What is UniFAST?"
        ],
        "responses": [
          "The IFSU Scholarship and Financial Assistance Section coordinates with CHED for implementing RA 10931, known as the Universal Access to Quality Tertiary Education Act. It supports students through programs such as Free Higher Education, Free TVET, TES, and the Student Loan Program.",
          "RA 10931 is a law that ensures all Filipino students have access to quality tertiary education. It supports programs like Free Higher Education and various subsidies to make education more accessible."
        ]
      },
      {
        "tag": "program_details",
        "patterns": [
          "What are the four programs under RA 10931?",
          "Explain Free Higher Education.",
          "What is Free TVET?",
          "Tell me about the Tertiary Education Subsidy (TES).",
          "What is the Student Loan Program (SLP)?"
        ],
        "responses": [
          "The four programs under RA 10931 are:<br> 1. Free Higher Education: Tuition and miscellaneous fees covered for students in their first undergraduate degree.<br> 2. Free TVET: Free training and related expenses for first post-secondary TESDA-registered TVET learners.<br> 3. Tertiary Education Subsidy (TES): Covers tuition and educational expenses for undergraduate students.<br> 4. Student Loan Program (SLP): Short-term loans for covering expenses in undergraduate and graduate programs."
        ]
      },
      {
        "tag": "eligibility_requirements",
        "patterns": [
          "Who is eligible for the Free Higher Education?",
          "What are the eligibility criteria for Free TVET?",
          "Who can apply for the Tertiary Education Subsidy?",
          "What are the requirements for the Student Loan Program?"
        ],
        "responses": [
          "Eligibility for the Free Higher Education program includes students enrolled in their first undergraduate degree who meet admission and retention policies. Free TVET is for learners not holding a National Certificate III or higher. The TES is for undergraduate students enrolled in SUCs, LUCs, and other recognized institutions. The SLP is available for students in SUCs, LUCs, quality-assured private HEIs, and TVIs.",
          "To qualify for financial assistance, applicants must be Filipino citizens, not hold a degree, meet specific academic performance (e.g., GWA requirements), and meet an income cap of Php 300,000 per year."
        ]
      },
      {
        "tag": "application_requirements",
        "patterns": [
          "What are the documentary requirements for the scholarship?",
          "What documents are needed for application?",
          "What academic records are required for the scholarship?"
        ],
        "responses": [
          "The application requirements include:<br> 1. Academic records such as certified grades for incoming freshmen or certificate of grades for college applicants.<br> 2. Proof of income such as ITR, Tax Exemption Certificate, Certificate of Indigency, or Affidavit of No Income.<br> 3. Certificate of Good Moral Character.<br> 4. Additional documents may include ALS and PEPT certificates if applicable."
        ]
      },
      {
        "tag": "financial_benefits",
        "patterns": [
          "What is the financial assistance amount for each program?",
          "How much does the Scholarship provide per academic year?",
          "What are the benefits of the Tulong Dunong Grant?"
        ],
        "responses": [
          "The financial benefits per academic year are:<br> 1. Scholarship: SSP - Php 30,000.00, PESFA - Php 15,000.00.<br> 2. Tulong Dunong: Varies based on tuition, with amounts up to Php 12,000.00 per year.",
          "The financial benefits include coverage of tuition, other school fees, and additional expenses, as needed for each program."
        ]
      },
      {
        "tag": "priority_courses",
        "patterns": [
          "What are the priority courses for scholarships?",
          "List the priority courses for AY 2014-2015.",
          "What courses are included in the CHED priority list?"
        ],
        "responses": [
          "Priority courses include:<br> - Information Technology, Engineering, Health Sciences, Agriculture, Education, Arts, Social Sciences, Business Administration, and others as outlined by CHED. Specific examples are Computer Science, Engineering disciplines, Pharmacy, and Teacher Education subjects."
        ]
      },
      {
        "tag": "contact_us",
        "patterns": [
          "How can I contact the Record Section?",
          "What is the email for the CED?",
          "How do I reach the DHRD department?",
          "Contact information for DSSD?",
          "What is the phone number for the Registrar?",
          "How do I contact the DFS Accounting?",
          "UniFAST contact details?",
          "What is the email for the Department of Sports Development?",
          "How can I contact the Library Services?",
          "Who do I contact for health services?",
          "Email address for the CAE?",
          "Contact info for the College of Education?",
          "How to reach the College of Health Sciences?",
          "What is the CASD contact information?",
          "Email for the College of Arts and Sciences?",
          "How can I reach the College of Criminal Justice Education?",
          "Contact information for CCS?"
        ],
        "responses": [
          "Here are the contact details for various departments and colleges: <br> - Record Section: ifsurecordsmain@gmail.com <br> - CED (Campus Executive Director): ifsu.cedlamutcampus@gmail.com <br> - DHRD (Department of Human Resources Development): 0916-932-1847, ifsu.hrdo@gmail.com <br> - DSSD (Department of Student Services & Development - Housing, Scholarship, and Guidance): ifsudssdmain1@gmail.com <br> - DRAS (Department of Registrar & Admission Services): 0955-726-5119, registrar@ifsu.edu.ph <br> - DFS - Accounting (Department of Finance Services - Accounting): accounting@ifsu.edu.ph <br> - UniFAST (Unified Student Financial Assistance System for Tertiary Education): unifastoffice@gmail.com <br> - DSD (Department of Sports Development): ifsudsd@gmail.com <br> - DLS (Department of Library Services): 0917-311-0405, ifsulibrary@yahoo.com, liza-tamargo@yahoo.com <br> - Health Services: ifsumainclinic@gmail.com <br> - CAE (College of Advanced Education): ifsucae2023@gmail.com <br> - COE (College of Education): collegeofeducation321@gmail.com <br> - CHS (College of Health Sciences): ifsu.chs.zoom@gmail.com <br> - CASD (College of Agriculture and Sustainable Development): ifsucahs@gmail.com <br> - CAS (College of Arts and Sciences): 0975-657-8037, xerdon17@gmail.com <br> - CCJE (College of Criminal Justice Education): 0975-916-4145, 0955-739-1312, ifsuccje2019@gmail.com <br> - CCS (College of Computing Sciences): 0999-789-5424, ccsifsu2019@gmail.com"
        ]
      },
      {
        "tag": "accreditation_status",
        "patterns": [
          "What is the accreditation status of programs?",
          "Tell me about the accreditation levels of courses.",
          "What programs are accredited in the main campus?",
          "Provide accreditation details for Potia campus.",
          "What are the accredited courses at Lagawe?",
          "Accreditation status for Tinoc campus?"
        ],
        "responses": [
          "Here is the accreditation status as of A.Y. 2018-2019:<br><br>**MAIN CAMPUS**<br>Program: Bachelor in Agricultural Technology (Majors: Animal Technology & Crop Technology)<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Bachelor of Elementary Education<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Bachelor of Secondary Education (Majors: English, Filipino, Math, Physical Science)<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Master of Arts in Education<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Master of Arts in Teaching (Majors: English, General Science, Filipino, Math)<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Master of Public Administration<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Bachelor of Science in Information Technology<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Bachelor of Science in Criminology<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Bachelor of Arts in Political Science<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Bachelor of Science in Home Technology<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Bachelor of Science in Nursing<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Master of Arts in Nursing (Majors: Maternal and Child Nursing, Nursing Service Administration)<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Doctor of Philosophy in Educational Management<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Doctor of Philosophy in Management<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Master of Science in Criminal Justice Education<br>Level of Accreditation: Level I Accredited<br><br>**POTIA CAMPUS**<br>Program: Bachelor of Elementary Education<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Bachelor of Secondary Education (Majors: English, General Science, Filipino, Math)<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Bachelor of Science in Agriculture (Majors: Crop Science, Animal Science, Agricultural Extension)<br>Level of Accreditation: Level III Re-accredited<br><br>Program: Bachelor of Science in Hotel and Restaurant Management<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Bachelor of Science in Information Technology<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Bachelor of Science in Criminology<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Bachelor of Science in Forestry<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Master of Arts in Education (Major: Educational Management)<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Master of Arts in Teaching (Majors: English, Filipino)<br>Level of Accreditation: Level II Re-accredited<br><br>**LAGAWE CAMPUS**<br>Program: Bachelor of Elementary Education<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Bachelor of Science in Business Administration (Majors: Marketing Management, Financial Management)<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Bachelor of Science in Hotel and Restaurant Management<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Bachelor of Secondary Education (Majors: English, TLE)<br>Level of Accreditation: Level II Re-accredited<br><br>Program: Bachelor of Science in Industrial Technology<br>Level of Accreditation: Level I Re-accredited<br><br>Program: Bachelor of Science in Civil Engineering<br>Level of Accreditation: Level I Accredited<br><br>Program: Bachelor of Science in Computer Engineering<br>Level of Accreditation: Level I Accredited<br><br>**TINOC CAMPUS**<br>Program: Bachelor of Elementary Education<br>Level of Accreditation: Level I Accredited"
        ]
      },
      {
        "tag": "ifsu_history",
        "patterns": [
          "Tell me about the history of Ifugao State University.",
          "What is the background of IFSU?",
          "How did Ifugao State University start?",
          "What are the major milestones in the history of IFSU?",
          "When did IFSU become a university?"
        ],
        "responses": [
          "Ifugao State University (IFSU) has a rich history that dates back to its founding in 1920 as Nayon Settlement Farm School (NSFS) by American educators. Initially offering general elementary instruction and agricultural projects, it closed during World War II but reopened after the war. The institution evolved over the years through the efforts of key pioneers like Mr. Felix U. Brawner, Sr. and Representative Luis Hora, leading to its transformation into the Ifugao Pilot Opportunity School of Agriculture (IPOSA) in 1961.",
          "IFSU's significant milestones include its evolution from the Ifugao Pilot Opportunity School of Agriculture (IPOSA) to the Ifugao Agricultural and Technical College (IATC) in 1975, followed by its conversion into the Ifugao State College of Agriculture and Forestry (ISCAF) in 1982, and finally its elevation to university status with Republic Act No. 9720 on October 14, 2009."
        ]
      },
      {
        "tag": "ifsu_pioneers",
        "patterns": [
          "Who were the key pioneers of IFSU?",
          "Tell me about the pioneers of Ifugao State University.",
          "What contributions did Mr. Felix U. Brawner, Sr. make to IFSU?",
          "Who was the first president of IFSU?"
        ],
        "responses": [
          "Key pioneers include Mr. Felix U. Brawner, Sr., who, along with Principal Raymundo de Leon, played a crucial role in the development of agricultural education. Another important figure was Representative Luis Hora, who championed the elevation of the school to a higher level. Dr. Toribio B. Adaci became the first president of ISCAF in 1985, and Dr. Serafin L. Ngohayon was the first president after its transformation into a university in 2009. Dr. Eva Marie Codamon-Dugyon was the first woman to hold the position of university president in 2018."
        ]
      },
      {
        "tag": "ifsu_achievements",
        "patterns": [
          "What are the recent achievements of IFSU?",
          "Tell me about the awards and recognitions received by IFSU.",
          "What significant accomplishments has IFSU made in recent years?",
          "Has IFSU received any national or international recognition?"
        ],
        "responses": [
          "Under the leadership of Dr. Eva Marie Codamon-Dugyon, IFSU has achieved significant milestones, such as being the first in the Cordillera Region to receive the Bronze award for Maturity Level II in PRIME-HRM. It also earned ISO 9001:2015 QMS Certification for three campuses and ranked as the National Top 3 Performing School in the Midwifery Licensure Examination in 2022 and Top 5 in the Criminology Licensure Examination in 2018. IFSU has also ranked in the Fourth Industrial Revolution (35th nationwide) and Global Top 100 Innovative Universities (101-200)."
        ]
      },
      {
        "tag": "ifsu_current_status",
        "patterns": [
          "What is the current status of IFSU?",
          "How many campuses does IFSU have now?",
          "Can you tell me about the current student population of IFSU?"
        ],
        "responses": [
          "As of now, IFSU has six campuses: Lamut (Main), Lagawe, Hapao, Potia, Aguinaldo, and Tinoc. It employs over 800 permanent staff and serves a total of 12,105 students."
        ]
      },
      {
        "tag": "ifsu_excellence",
        "patterns": [
          "What is the core value of excellence at IFSU?",
          "Tell me about IFSU's commitment to excellence.",
          "What does IFSU mean by excellence?",
          "Explain how IFSU achieves excellence in its services."
        ],
        "responses": [
          "Excellence at IFSU is defined by a strong commitment to achieving superior quality outputs and services across instruction, research, extension, resource generation, and administration."
        ]
      },
      {
        "tag": "ifsu_faith",
        "patterns": [
          "What is the core value of faith at IFSU?",
          "Tell me about the role of faith at IFSU.",
          "How does faith guide IFSU's undertakings?",
          "Explain IFSU's belief in God and how it influences the university."
        ],
        "responses": [
          "Faith at IFSU represents the university's belief in GOD Almighty, who guides all its undertakings and endeavors. It also embodies the trust and confidence shared by the university community members toward harmonious living."
        ]
      },
      {
        "tag": "ifsu_integrity",
        "patterns": [
          "What does integrity mean for IFSU?",
          "How is integrity practiced at IFSU?",
          "Tell me about IFSU's commitment to integrity.",
          "What are the ethical values that IFSU upholds?"
        ],
        "responses": [
          "Integrity at IFSU means adhering to moral and ethical values, ensuring conformity to principle-driven service in line with the university's vision, mission, and goals."
        ]
      },
      {
        "tag": "ifsu_service",
        "patterns": [
          "What does service mean for IFSU?",
          "Explain IFSU's commitment to service.",
          "How does IFSU serve its stakeholders?",
          "What is the significance of service to IFSU?"
        ],
        "responses": [
          "Service at IFSU is recognized as the essence of its existence, focusing on serving clienteles and stakeholders for the common good."
        ]
      },
      {
        "tag": "ifsu_creativity",
        "patterns": [
          "What is the core value of creativity at IFSU?",
          "Tell me about IFSU's commitment to fostering creativity.",
          "How does IFSU encourage innovation and resourcefulness?",
          "What role does creativity play in IFSU's teaching and learning environment?"
        ],
        "responses": [
          "Creativity at IFSU involves creating and nurturing an environment that promotes innovation, dynamism, and resourcefulness. The university focuses on fostering critical thinking, problem-solving, communication, and collaboration to pursue global recognition while preserving its rich cultural heritage."
        ]
      },
      {
        "tag": "ifsu_cultural_sensitivity",
        "patterns": [
          "What is the core value of cultural-sensitivity at IFSU?",
          "How does IFSU preserve cultural heritage?",
          "Tell me about IFSU's commitment to cultural sensitivity.",
          "Why is cultural preservation important to IFSU?"
        ],
        "responses": [
          "Cultural sensitivity at IFSU is reflected in its commitment to preserving the rich cultural heritage of the province and the region, promoting a deeper appreciation of its traditions and identity."
        ]
      },
      {
        "tag": "ifsu_core_values",
        "patterns": [
          "What are the core values of IFSU?",
          "Tell me about IFSU's core values.",
          "What are the principles that IFSU upholds?",
          "Can you list and explain IFSU's core values?"
        ],
        "responses": [
          "IFSU's core values are as follows:<br><br>1. **Excellence**: A strong commitment to achieving superior quality outputs and services in instruction, research, extension, resource generation, and administration.<br>2. **Faith**: A belief in GOD Almighty, guiding the university’s endeavors and fostering trust and harmonious living among its members.<br>3. **Integrity**: Adherence to moral and ethical values, ensuring service aligns with the university’s vision, mission, and goals.<br>4. **Service**: Recognizing that serving clienteles and stakeholders for the common good is essential to IFSU’s purpose.<br>5. **Creativity**: Creating and nurturing an environment that encourages innovation, critical thinking, problem-solving, communication, and collaboration.<br>6. **Cultural Sensitivity**: Preserving the rich cultural heritage of the province and region, promoting an appreciation of traditions and identity."
        ]
      },
      {
        "tag": "ifsu_vision",
        "patterns": [
          "What is the vision of IFSU?",
          "Tell me about IFSU's vision.",
          "What does IFSU strive for in its vision?",
          "Explain the vision of IFSU."
        ],
        "responses": [
          "The vision of IFSU is to be a globally recognized university that upholds excellence amidst a rich cultural heritage."
        ]
      },
      {
        "tag": "ifsu_mission",
        "patterns": [
          "What is the mission of IFSU?",
          "Tell me about IFSU's mission.",
          "What does IFSU aim to achieve in its mission?",
          "Explain the mission of IFSU."
        ],
        "responses": [
          "The mission of IFSU is to produce employable graduates who are morally upright, socially and culturally responsible professionals through quality, relevant, and innovative instruction, research, extension, and resource generation."
        ]
      },
      {
        "tag": "ifsu_goal_academic_excellence",
        "patterns": [
          "What are the goals related to academic excellence at IFSU?",
          "Tell me about IFSU's objectives for academic excellence.",
          "What does IFSU do to achieve academic excellence?",
          "Explain the objectives for academic excellence at IFSU."
        ],
        "responses": [
          "The goal of academic excellence at IFSU includes ensuring the quality of programs to achieve 71% - 100% accredited programs, supporting effective student lifecycle management to achieve 50% employment rate for graduates, attaining a 70% passing rate for first-time board exam takers, integrating an internationalization perspective to increase international students and partners by 5%, and strengthening student welfare services with 90% positive ratings."
        ]
      },
      {
        "tag": "ifsu_goal_research",
        "patterns": [
          "What are the goals related to research at IFSU?",
          "Tell me about IFSU's objectives for research leadership and culture.",
          "What does IFSU do to promote research?",
          "Explain the research goals and objectives of IFSU."
        ],
        "responses": [
          "IFSU's goal for research includes establishing a strong brand as a research leader with 29 research outputs utilized by the industry or beneficiaries, increasing the percentage of active research by faculty by 12% every three years, promoting research that leads to commercialization or livelihood improvement by 10%, and fostering research that results in extension programs by 10%."
        ]
      },
      {
        "tag": "ifsu_goal_community_engagement",
        "patterns": [
          "What are the goals related to community engagement at IFSU?",
          "Tell me about IFSU's objectives for extension and community engagement.",
          "What does IFSU do for community engagement?",
          "Explain IFSU's goals in sustainable extension and community involvement."
        ],
        "responses": [
          "IFSU aims to package and transfer knowledge and technologies relevant to client needs with a 95% satisfaction rating. It also seeks to create a culture that encourages and rewards engagement, with 30 faculty and 100 students volunteering annually, and strengthen partnerships with LGUs and other stakeholders to enhance resource-sharing and program collaboration with a 20% increase in active partnerships."
        ]
      },
      {
        "tag": "ifsu_goal_public_service",
        "patterns": [
          "What are the goals related to public service and governance at IFSU?",
          "Tell me about IFSU's objectives for excellent public service.",
          "What does IFSU do to ensure good governance?",
          "Explain IFSU's goals for public service and administration."
        ],
        "responses": [
          "IFSU's public service and governance goals include ensuring efficient, transparent, and accountable administrative services with a 95% client satisfaction rating, establishing a strong network system, enhancing local and international visibility, boosting resource generation by 10% in 2019 and 20% annually from 2020, upgrading human resources with 15% of faculty attending relevant training, and integrating technology into services with 100% operational systems."
        ]
      },
      {
        "tag": "university_president",
        "patterns": [
          "Who is the university president?",
          "Tell me about the president of IFSU.",
          "Who leads IFSU as president?",
          "Give details about the university president."
        ],
        "responses": [
          "The university president of IFSU is Dr. Eva Marie Codamon-Dugyon. You can contact her at president@ifsu.edu.ph or president201801.ifsu@gmail.com."
        ]
      },
      {
        "tag": "vice_presidents",
        "patterns": [
          "Who are the vice presidents at IFSU?",
          "Tell me about the vice presidents of IFSU.",
          "Who holds the position of vice president at IFSU?",
          "Give me information on IFSU's vice presidents."
        ],
        "responses": [
          "The vice presidents at IFSU are: Dr. Mary P. Caclini (Academic Affairs), Dr. Freddie B. Caday (Administration), Dr. Marissa P. Bulong (Research, Development, Extension, and Training), and Dr. Diosdado M. Aquino (Planning, Finance, & Resource Generation). For contact details, you can reach them at their respective emails: ifsuvpacad@gmail.com, cadayf@gmail.com, marissapbulong@gmail.com, and aquinodiosdado@gmail.com."
        ]
      },
      {
        "tag": "campus_executive_directors",
        "patterns": [
          "Who are the campus executive directors at IFSU?",
          "Tell me about the campus executive directors of IFSU.",
          "Who manages the different campuses at IFSU?",
          "Give information about IFSU campus executive directors."
        ],
        "responses": [
          "The campus executive directors at IFSU are: Dir. Nathaniel F. Dimog (Main Campus), Dir. Jocelyn T. Salviejo (Potia Campus), Dr. Vicky K. Cadalig (Lagawe Campus), Dir. Daisy T. Bando (Tinoc Campus), Dir. Regina G. Gano (Hapao Campus, OIC), and Dr. Domingo Junior P. Ngipol (Aguinaldo Campus). You can contact them at their respective emails: ndimog@yahoo.com, ifsupotiacedoffice@gmail.com, vikicad@yahoo.com, daisybando@gmail.com, idz.gina@gmail.com, and ngipoldj@gmail.com."
        ]
      },
      {
        "tag": "college_deans",
        "patterns": [
          "Who are the college deans at IFSU?",
          "Tell me about the college deans of IFSU.",
          "What are the names of IFSU's college deans?",
          "Provide information about the college deans at IFSU.",
          "Dean of IFSU",
          "Dean",
          "IFSU Dean"
        ],
        "responses": [
          "The college deans at IFSU are: Dr. Jennifer Madonna G. Dait (CAE, Main Campus), Dr. Desiree Gume G. Nangpuhan (COE, Main Campus), Dr. Leonard Ivan T. Melana (CHS, Main Campus), Dr. Napoleon K. Taguiling (CASD, Main Campus), Dr. Donato O. Abaya (CAS, Main Campus), Dr. Janice P. Milo (CCJE, Main Campus), Dr. Myle Melody D. Corpuz (CCS, Main Campus), Dr. Roger D. Capua (CAE, Potia Campus), Dr. Matronillo M. Martin (COE, Potia Campus), Mr. Andrew D. Kimayong (CASD, Potia Campus), Dr. Lorna C. Ildefonso (CBM, Potia Campus), Dr. Domingo Junior P. Ngipol (Engineering and Technology, Potia Campus), Dr. Moises A. Guay (CCJE, Potia Campus), Dr. Fernando G. Hernando (CAE, Lagawe Campus), Dr. Dizon B. Tayaban (COE, Lagawe Campus), Dr. John G. Pagaddut (CBM, Lagawe Campus), and Engr. Marianne B. Malingan (CET, Lagawe Campus)."
        ]
      },
      {
        "tag": "college_deans_main",
        "patterns": [
          "Who are the college deans at IFSU?",
          "Tell me about the college deans of IFSU.",
          "What are the names of IFSU's college deans?",
          "Provide information about the college deans at IFSU."
        ],
        "responses": [
          "The college deans at IFSU Main Campus are: Dr. Jennifer Madonna G. Dait (CAE), Dr. Desiree Gume G. Nangpuhan (COE), Dr. Leonard Ivan T. Melana (CHS), Dr. Napoleon K. Taguiling (CASD), Dr. Donato O. Abaya (CAS), Dr. Janice P. Milo (CCJE), Dr. Myle Melody D. Corpuz (CCS)."
        ]
      },
      {
        "tag": "deans",
        "patterns": [
          "Dean of IFSU",
          "Deans of IFSU",
          "Deans",
          "Dean",
          "IFSU Dean",
          "IFSU Deans"
        ],
        "responses": [
          "The college deans at IFSU Main Campus are: Dr. Jennifer Madonna G. Dait (CAE), Dr. Desiree Gume G. Nangpuhan (COE), Dr. Leonard Ivan T. Melana (CHS), Dr. Napoleon K. Taguiling (CASD), Dr. Donato O. Abaya (CAS), Dr. Janice P. Milo (CCJE), Dr. Myle Melody D. Corpuz (CCS)."
        ]
      },
      {
        "tag": "college_deans_potia",
        "patterns": [
          "Who are the college deans at IFSU Potia Campus?",
          "Tell me about the college deans at IFSU Potia Campus.",
          "What are the names of IFSU's Potia Campus college deans?"
        ],
        "responses": [
          "The college deans at IFSU Potia Campus are: Dr. Roger D. Capua (CAE), Dr. Matronillo M. Martin (COE), Mr. Andrew D. Kimayong (CASD), Dr. Lorna C. Ildefonso (CBM), Dr. Domingo Junior P. Ngipol (Engineering and Technology), Dr. Moises A. Guay (CCJE)."
        ]
      },
      {
        "tag": "college_deans_lagawe",
        "patterns": [
          "Who are the college deans at IFSU Lagawe Campus?",
          "Tell me about the college deans at IFSU Lagawe Campus.",
          "What are the names of IFSU's Lagawe Campus college deans?"
        ],
        "responses": [
          "The college deans at IFSU Lagawe Campus are: Dr. Fernando G. Hernando (CAE), Dr. Dizon B. Tayaban (COE), Dr. John G. Pagaddut (CBM), Engr. Marianne B. Malingan (CET)."
        ]
      },
      {
        "tag": "college_dean_cae",
        "patterns": [
          "Who is the College Dean for CAE?",
          "Tell me about the College Dean for CAE.",
          "Who is the Dean of CAE?",
          "Who is the College Dean for College of Advanced Education?",
          "Tell me about the College Dean for College of Advanced Education.",
          "Who is the Dean of College of Advanced Education?"
        ],
        "responses": [
          "The College Dean for CAE at IFSU Main Campus is Dr. Jennifer Madonna G. Dait."
        ]
      },
      {
        "tag": "college_dean_coe",
        "patterns": [
          "Who is the College Dean for COE?",
          "Tell me about the College Dean for COE.",
          "Who is the Dean of COE?",
          "Who is the College Dean for College of Education?",
          "Tell me about the College Dean for College of Education.",
          "Who is the Dean of College of Education?"
        ],
        "responses": [
          "The College Dean for COE at IFSU Main Campus is Dr. Desiree Gume G. Nangpuhan."
        ]
      },
      {
        "tag": "college_dean_chs",
        "patterns": [
          "Who is the College Dean for CHS?",
          "Tell me about the College Dean for CHS.",
          "Who is the Dean of CHS?",
          "Who is the College Dean for College of Health Sciences?",
          "Tell me about the College Dean for College of Health Sciences.",
          "Who is the Dean of College of Health Sciences?"
        ],
        "responses": [
          "The College Dean for CHS at IFSU Main Campus is Dr. Leonard Ivan T. Melana."
        ]
      },
      {
        "tag": "college_dean_casd",
        "patterns": [
          "Who is the College Dean for CASD?",
          "Tell me about the College Dean for CASD.",
          "Who is the Dean of CASD?",
          "Who is the College Dean for College of Agriculture and Sustainable Development?",
          "Tell me about the College Dean for College of Agriculture and Sustainable Development.",
          "Who is the Dean of College of Agriculture and Sustainable Development?"
        ],
        "responses": [
          "The College Dean for CASD at IFSU Main Campus is Dr. Napoleon K. Taguiling."
        ]
      },
      {
        "tag": "college_dean_cas",
        "patterns": [
          "Who is the College Dean for CAS?",
          "Tell me about the College Dean for CAS.",
          "Who is the Dean of CAS?",
          "Who is the College Dean for College of Arts and Sciences?",
          "Tell me about the College Dean for College of Arts and Sciences.",
          "Who is the Dean of College of Arts and Sciences?"
        ],
        "responses": [
          "The College Dean for CAS at IFSU Main Campus is Dr. Donato O. Abaya."
        ]
      },
      {
        "tag": "college_dean_ccje",
        "patterns": [
          "Who is the College Dean for CCJE?",
          "Tell me about the College Dean for CCJE.",
          "Who is the Dean of CCJE?",
          "Who is the College Dean for College of Criminal Justice Education?",
          "Tell me about the College Dean for College of Criminal Justice Education.",
          "Who is the Dean of College of Criminal Justice Education?"
        ],
        "responses": [
          "The College Dean for CCJE at IFSU Main Campus is Dr. Janice P. Milo."
        ]
      },
      {
        "tag": "college_dean_ccs",
        "patterns": [
          "Who is the College Dean for CCS?",
          "Tell me about the College Dean for CCS.",
          "Who is the Dean of CCS?",
          "Who is the College Dean for College of Computing Sciences?",
          "Tell me about the College Dean for College of Computing Sciences.",
          "Who is the Dean of College of Computing Sciences?"
        ],
        "responses": [
          "The College Dean for CCS at IFSU Main Campus is Dr. Myle Melody D. Corpuz."
        ]
      },
      {
        "tag": "college_dean_potia_cae",
        "patterns": [
          "Who is the College Dean for CAE at Potia Campus?",
          "Tell me about the College Dean for CAE at Potia Campus.",
          "Who is the Dean of CAE at Potia Campus?",
          "Who is the College Dean for College of Advanced Education at Potia Campus?",
          "Tell me about the College Dean for College of Advanced Education at Potia Campus.",
          "Who is the Dean of College of Advanced Education at Potia Campus?"
        ],
        "responses": [
          "The College Dean for CAE at IFSU Potia Campus is Dr. Roger D. Capua."
        ]
      },
      {
        "tag": "college_dean_potia_coe",
        "patterns": [
          "Who is the College Dean for COE at Potia Campus?",
          "Tell me about the College Dean for COE at Potia Campus.",
          "Who is the Dean of COE at Potia Campus?",
          "Who is the College Dean for College of Education at Potia Campus?",
          "Tell me about the College Dean for College of Education at Potia Campus.",
          "Who is the Dean of College of Education at Potia Campus?"
        ],
        "responses": [
          "The College Dean for COE at IFSU Potia Campus is Dr. Matronillo M. Martin."
        ]
      },
      {
        "tag": "college_dean_potia_casd",
        "patterns": [
          "Who is the College Dean for CASD at Potia Campus?",
          "Tell me about the College Dean for CASD at Potia Campus.",
          "Who is the Dean of CASD at Potia Campus?",
          "Who is the College Dean for College of Agriculture and Sustainable Development at Potia Campus?",
          "Tell me about the College Dean for College of Agriculture and Sustainable Development at Potia Campus.",
          "Who is the Dean of College of Agriculture and Sustainable Development at Potia Campus?"
        ],
        "responses": [
          "The College Dean for CASD at IFSU Potia Campus is Mr. Andrew D. Kimayong."
        ]
      },
      {
        "tag": "college_dean_potia_cbm",
        "patterns": [
          "Who is the College Dean for CBM at Potia Campus?",
          "Tell me about the College Dean for CBM at Potia Campus.",
          "Who is the Dean of CBM at Potia Campus?",
          "Who is the College Dean for College of Business and Management at Potia Campus?",
          "Tell me about the College Dean for College of Business and Management at Potia Campus.",
          "Who is the Dean of College of Business and Management at Potia Campus?"
        ],
        "responses": [
          "The College Dean for CBM at IFSU Potia Campus is Dr. Lorna C. Ildefonso."
        ]
      },
      {
        "tag": "college_dean_potia_engtech",
        "patterns": [
          "Who is the College Dean for Engineering and Technology at Potia Campus?",
          "Tell me about the College Dean for Engineering and Technology at Potia Campus.",
          "Who is the Dean of Engineering and Technology at Potia Campus?",
          "Who is the College Dean for CET at Potia Campus?",
          "Tell me about the College Dean for CET at Potia Campus.",
          "Who is the Dean of CET at Potia Campus?"
        ],
        "responses": [
          "The College Dean for Engineering and Technology at IFSU Potia Campus is Dr. Domingo Junior P. Ngipol."
        ]
      },
      {
        "tag": "abbreviation_cae",
        "patterns": [
          "What does CAE stand for?",
          "Explain CAE.",
          "What is the meaning of CAE?",
          "What is CAE short for?"
        ],
        "responses": [
          "CAE stands for College of Advanced Education."
        ]
      },
      {
        "tag": "abbreviation_coe",
        "patterns": [
          "What does COE stand for?",
          "Explain COE.",
          "What is the meaning of COE?",
          "What is COE short for?"
        ],
        "responses": [
          "COE stands for College of Education."
        ]
      },
      {
        "tag": "abbreviation_chs",
        "patterns": [
          "What does CHS stand for?",
          "Explain CHS.",
          "What is the meaning of CHS?",
          "What is CHS short for?"
        ],
        "responses": [
          "CHS stands for College of Health Sciences."
        ]
      },
      {
        "tag": "abbreviation_casd",
        "patterns": [
          "What does CASD stand for?",
          "Explain CASD.",
          "What is the meaning of CASD?",
          "What is CASD short for?"
        ],
        "responses": [
          "CASD stands for College of Agriculture and Sustainable Development."
        ]
      },
      {
        "tag": "abbreviation_cas",
        "patterns": [
          "What does CAS stand for?",
          "Explain CAS.",
          "What is the meaning of CAS?",
          "What is CAS short for?"
        ],
        "responses": [
          "CAS stands for College of Arts and Sciences."
        ]
      },
      {
        "tag": "abbreviation_ccje",
        "patterns": [
          "What does CCJE stand for?",
          "Explain CCJE.",
          "What is the meaning of CCJE?",
          "What is CCJE short for?",
          "CCJE"
        ],
        "responses": [
          "CCJE stands for College of Criminal Justice Education."
        ]
      },
      {
        "tag": "abbreviation_ccs",
        "patterns": [
          "What does CCS stand for?",
          "Explain CCS.",
          "What is the meaning of CCS?",
          "What is CCS short for?"
        ],
        "responses": [
          "CCS stands for College of Computing Sciences."
        ]
      },
      {
        "tag": "directors_services_departments",
        "patterns": [
          "Who are the directors of services departments at IFSU?",
          "Tell me about the directors of service departments at IFSU.",
          "What are the names of IFSU's service department directors?",
          "Provide details about the directors of service departments at IFSU."
        ],
        "responses": [
          "The directors of service departments at IFSU include: Dr. Juliet C. Daniels (DFS), Dr. Jamaica G. Bumidang (DAS), Dir. Stradivary D. Caro (DGS), Engr. Marianne B. Malingan (DISD), Dir. Desiree A. Ballitoc (DSSD), Dir. Jocelyn A. Guimpatán (DRAS), Dir. Karen M. Cumti (DSD), Dr. Leudane L. Loñez (DNSTP), Dr. Liza M. Tamargo (DLS), Dir. Lalie Vic A. Cawilan (DCA), Dr. Florence N. Bahni (DRD), Dr. Marah Joy A. Nanglegan (DET), Dir. Judy C. Baggo (IRT GIAHS Center), Dr. Serafin L. Ngohayon (IFEC), Dr. Rhoda S. Bunoan (DPIM), Dir. Elyn A. Boligon (DIGP), Dir. Fedelym M. Pugong (DHRD), Dr. Joyce A. Bodah (GADRRC), Dr. Jeng Jeng M. Bolintao (DQuA), Dr. Manuel P. Malingan III (DAA), Engr. Ryan R. Tejada (Career Development Center), Dr. Moses B. Appoy (IPTBM Center), Atty. Aiza Liza Namingit-Velasco (DLegS), and Mr. Julian B. Nangpuhan II (University and Board Secretary)."
        ]
      },
      {
        "tag": "university_officials",
        "patterns": [
          "Who are the university officials at IFSU?",
          "Tell me about the university officials at IFSU.",
          "Give me details on all university officials.",
          "Who holds the official positions at IFSU?"
        ],
        "responses": [
          "The university officials at IFSU include:<br>- President: Dr. Eva Marie Codamon-Dugyon<br>- Vice Presidents:<br>  - Dr. Mary P. Caclini (Academic Affairs)<br>  - Dr. Freddie B. Caday (Administration)<br>  - Dr. Marissa P. Bulong (Research, Development, Extension, and Training)<br>  - Dr. Diosdado M. Aquino (Planning, Finance, & Resource Generation)<br>- Campus Executive Directors:<br>  - Dir. Nathaniel F. Dimog (Main Campus)<br>  - Dir. Jocelyn T. Salviejo (Potia Campus)<br>  - Dr. Vicky K. Cadalig (Lagawe Campus)<br>  - Dir. Daisy T. Bando (Tinoc Campus)<br>  - Dir. Regina G. Gano (Hapao Campus, OIC)<br>  - Dr. Domingo Junior P. Ngipol (Aguinaldo Campus)<br>- College Deans:<br>  - Dr. Jennifer Madonna G. Dait (CAE, Main Campus)<br>  - Dr. Desiree Gume G. Nangpuhan (COE, Main Campus)<br>  - Dr. Leonard Ivan T. Melana (CHS, Main Campus)<br>  - Dr. Napoleon K. Taguiling (CASD, Main Campus)<br>  - Dr. Donato O. Abaya (CAS, Main Campus)<br>  - Dr. Janice P. Milo (CCJE, Main Campus)<br>  - Dr. Myle Melody D. Corpuz (CCS, Main Campus)<br>  - Dr. Roger D. Capua (CAE, Potia Campus)<br>  - Dr. Matronillo M. Martin (COE, Potia Campus)<br>  - Mr. Andrew D. Kimayong (CASD, Potia Campus)<br>  - Dr. Lorna C. Ildefonso (CBM, Potia Campus)<br>  - Dr. Domingo Junior P. Ngipol (Engineering and Technology, Potia Campus)<br>  - Dr. Moises A. Guay (CCJE, Potia Campus)<br>  - Dr. Fernando G. Hernando (CAE, Lagawe Campus)<br>  - Dr. Dizon B. Tayaban (COE, Lagawe Campus)<br>  - Dr. John G. Pagaddut (CBM, Lagawe Campus)<br>  - Engr. Marianne B. Malingan (CET, Lagawe Campus)<br>- Directors of Service Departments:<br>  - Dr. Juliet C. Daniels (DFS)<br>  - Dr. Jamaica G. Bumidang (DAS)<br>  - Dir. Stradivary D. Caro (DGS)<br>  - Engr. Marianne B. Malingan (DISD)<br>  - Dir. Desiree A. Ballitoc (DSSD)<br>  - Dir. Jocelyn A. Guimpatán (DRAS)<br>  - Dir. Karen M. Cumti (DSD)<br>  - Dr. Leudane L. Loñez (DNSTP)<br>  - Dr. Liza M. Tamargo (DLS)<br>  - Dir. Lalie Vic A. Cawilan (DCA)<br>  - Dr. Florence N. Bahni (DRD)<br>  - Dr. Marah Joy A. Nanglegan (DET)<br>  - Dir. Judy C. Baggo (IRT GIAHS Center)<br>  - Dr. Serafin L. Ngohayon (IFEC)<br>  - Dr. Rhoda S. Bunoan (DPIM)<br>  - Dir. Elyn A. Boligon (DIGP)<br>  - Dir. Fedelym M. Pugong (DHRD)<br>  - Dr. Joyce A. Bodah (GADRRC)<br>  - Dr. Jeng Jeng M. Bolintao (DQuA)<br>  - Dr. Manuel P. Malingan III (DAA)<br>  - Engr. Ryan R. Tejada (Career Development Center)<br>  - Dr. Moses B. Appoy (IPTBM Center)<br>  - Atty. Aiza Liza Namingit-Velasco (DLegS)<br>  - Mr. Julian B. Nangpuhan II (University and Board Secretary)"
        ]
      },
      {
        "tag": "university_facilities",
        "patterns": [
          "Tell me about the sports facilities at IFSU.",
          "What indoor and outdoor facilities are available at IFSU?",
          "Give me details on the university's campus facilities.",
          "What health and accommodation services are offered by IFSU?"
        ],
        "responses": [
          "Facilities at IFSU include:<br>- Sports Facilities:<br>  - Indoor Fitness Gym: A state-of-the-art facility supporting health and wellness, equipped with modern equipment for all fitness levels and instruction for Physical Education.<br>  - Indoor Sports Court: A versatile space for activities such as basketball, badminton, volleyball, table tennis, and more.<br>  - Outdoor Sports Court: A space designed for sports events and recreational activities.<br>  - Outdoor Sports Field: Accommodates football, baseball, softball, and athletics with optimal playing conditions.<br>  - Swimming Pool: Utilized for instruction, training, and competitions through an agreement with Tam-an Mountain Resort and Hotel.<br>- Campus Facilities:<br>  - Bookstore: A one-stop shop for textbooks, school supplies, university-branded apparel, and more.<br>  - Cafeteria/Restaurant: A space offering meals and snacks, perfect for students and staff.<br>  - Inclusive Access: Wheelchair ramps are provided across campus to ensure accessibility for PWDs and students with special needs.<br>  - Religious Facilities: Spaces for practicing faith and exploring spirituality.<br>  - Social Room: A hub for students to unwind, connect, and foster friendships.<br>  - Support Centre for Minority Groups: Promotes cultural conservation and indigenous education.<br>- Student and Employee Accommodation:<br>  - Dormitory and Housing Program: Affordable lodging provided by IFSU to support a community-focused environment with easy access to facilities.<br>- Health Support Services:<br>  - Health Services Unit: Offers routine checkups, preventive care, and emergency response.<br>  - IFSU Eye Center: The only eye care facility in the region, offering comprehensive eye care services.<br>- Technology in the Classroom:<br>  - Computer Equipped Teaching Spaces: Classrooms with interactive panels to enhance learning.<br>  - Coworking and Meeting Spaces: Equipped with internet access for collaborative work.<br>  - Labs with Specialised Equipment.<br>  - Printing Services: The IFSU Printing Center provides customized printing and publication services.<br>  - Teaching Space with Audiovisual Equipment: Equipped with interactive panels, multimedia speakers, and microphones for dynamic presentations.<br>- Arts Facilities:<br>  - Arts Studio: A space for students to immerse themselves in creative work.<br>  - Campus Arts Exhibition Program: Opportunities for artists to showcase work and engage audiences.<br>  - Concert Hall: A venue for music presentations and performances.<br>  - Music Practice Room: For student recitals and musical activities.<br>  - Purpose-built Museum: Showcases artifacts related to Ifugao culture and traditions.<br>  - Theater Convention Hall: Provides a platform for cultural expression and artistic presentations."
        ]
      },
      {
        "tag": "sports_facilities",
        "patterns": [
          "Tell me about the sports facilities at IFSU.",
          "What indoor and outdoor facilities are available at IFSU?",
          "Describe the sports facilities on campus."
        ],
        "responses": [
          "IFSU offers excellent sports facilities that include:<br>- Indoor Fitness Gym: Equipped with modern equipment for fitness enthusiasts and students participating in Physical Education.<br>- Indoor Sports Court: A multi-use facility for basketball, volleyball, badminton, table tennis, and other activities.<br>- Outdoor Sports Court: Ideal for various recreational and competitive sports.<br>- Outdoor Sports Field: Suitable for football, baseball, softball, and athletic events.<br>- Swimming Pool: Used for training, instruction, and competitions through an agreement with Tam-an Mountain Resort and Hotel."
        ]
      },
      {
        "tag": "campus_facilities",
        "patterns": [
          "Give me details on the university's campus facilities.",
          "What facilities does IFSU have on campus?",
          "Describe the facilities available for students at IFSU."
        ],
        "responses": [
          "The IFSU campus provides a range of facilities such as:<br>- Bookstore: Stocks textbooks, supplies, and IFSU-branded merchandise.<br>- Cafeteria/Restaurant: Offers a variety of meals and snacks for students and staff.<br>- Inclusive Access: Wheelchair ramps are available for accessibility needs.<br>- Religious Facilities: Spaces dedicated to spiritual practices.<br>- Social Room: A place for relaxation, socializing, and community building.<br>- Support Centre for Minority Groups: Promotes cultural heritage and indigenous education."
        ]
      },
      {
        "tag": "accommodation",
        "patterns": [
          "What are the accommodation options at IFSU?",
          "Does IFSU offer dormitory facilities?",
          "Give me information on student housing at IFSU."
        ],
        "responses": [
          "IFSU provides student accommodation through its Dormitory and Housing Program. This affordable lodging option fosters a community-oriented environment, offering easy access to university facilities and activities."
        ]
      },
      {
        "tag": "health_services",
        "patterns": [
          "What health services are available at IFSU?",
          "Tell me about the health support services provided by IFSU.",
          "Does IFSU have a health center?"
        ],
        "responses": [
          "IFSU is committed to student well-being with services that include:<br>- Health Services Unit: Provides routine checkups, preventive care, and emergency response.<br>- IFSU Eye Center: The only eye care facility in the region, offering comprehensive eye services."
        ]
      },
      {
        "tag": "technology_facilities",
        "patterns": [
          "What technology resources are available at IFSU?",
          "Describe the technology facilities at IFSU.",
          "Does IFSU have computer-equipped classrooms?"
        ],
        "responses": [
          "IFSU offers a robust technological infrastructure, which includes:<br>- Computer Equipped Teaching Spaces: Classrooms with interactive panels and modern tech to enhance learning.<br>- Coworking and Meeting Spaces: Equipped with internet access for collaboration.<br>- Specialized Labs: Provide facilities for research and student projects.<br>- Printing Services: The IFSU Printing Center offers tailored printing and publishing services.<br>- Teaching Spaces with Audiovisual Equipment: Classrooms feature multimedia speakers and interactive panels for dynamic presentations."
        ]
      },
      {
        "tag": "arts_facilities",
        "patterns": [
          "What are the arts facilities at IFSU?",
          "Describe the arts and music resources available at IFSU.",
          "Does IFSU have a museum or theater?"
        ],
        "responses": [
          "IFSU supports creativity with facilities like:<br>- Arts Studio: A space for students to create art and explore various media.<br>- Campus Arts Exhibition Program: Provides a platform for showcasing artistic work.<br>- Concert Hall: Hosts musical performances and events.<br>- Music Practice Room: Used for student recitals and musical rehearsals.<br>- Purpose-built Museum: Showcases Ifugao artifacts and cultural heritage.<br>- Theater Convention Hall: A venue for performances and cultural expressions."
        ]
      },
      {
        "tag": "integrity_principles",
        "patterns": [
          "What is the university principle on organized crime, corruption, and bribery at IFSU?",
          "Tell me about the integrity-driven policies at IFSU.",
          "What are IFSU’s measures against corruption and bribery?"
        ],
        "responses": [
          "At Ifugao State University, integrity is a core value guiding our commitment to transparency, fairness, and accountability. We uphold integrity across all operations and interactions to nurture an environment of trust, respect, and lawful conduct. Our policies and executive orders are designed to combat organized crime, corruption, and bribery, ensuring IFSU remains a safe and ethical institution."
        ]
      },
      {
        "tag": "executive_order_codi",
        "patterns": [
          "What is Executive Order No. 12, s. 2023 about?",
          "Tell me about the Committee on Decorum and Investigation (CODI) at IFSU.",
          "What are the objectives of Executive Order No. 12, s. 2023?"
        ],
        "responses": [
          "Executive Order No. 12, s. 2023 titled 'Composition of the Committee on Decorum and Investigation (CODI)' was established to implement revised administrative disciplinary rules on sexual harassment within the University. This aligns with CSC Memorandum No. 11, s. 2020 and is essential for upholding the rule of law, preventing sexual harassment, and maintaining peace and justice within the institution."
        ]
      },
      {
        "tag": "executive_order_anti_red_tape",
        "patterns": [
          "What does Executive Order No. 03, s. 2023 entail?",
          "Explain the functions of the Anti-Red Tape Act Committee at IFSU.",
          "How does Executive Order No. 03, s. 2023 support anti-corruption?"
        ],
        "responses": [
          "Executive Order No. 03, s. 2023 amends and updates the functions of the Anti-Red Tape Act Committee, pursuant to Republic Act No. 9485 as amended by Republic Act No. 11032 and its Implementing Rules and Regulations. These laws aim to improve the efficiency of government services by reducing bureaucratic red tape, preventing graft and corruption, and imposing penalties as needed."
        ]
      },
      {
        "tag": "no_noon_break_policy",
        "patterns": [
          "What is the 'No Noon Break' Policy at IFSU?",
          "Tell me about Executive Order No. 18, s. 2023.",
          "How does IFSU prevent bribery and corruption through its policies?"
        ],
        "responses": [
          "The 'No Noon Break' Policy, mandated by Republic Act No. 9485, requires government agencies to serve clients present before the end of the workday, even during lunch breaks. Executive Order No. 18, s. 2023 reiterates this policy for IFSU. Additionally, Executive Order No. 07, s. 2023 mandates the use of Biometrics Machines for timekeeping and locator slips among employees, promoting transparency, accountability, and preventing bribery."
        ]
      },
      {
        "tag": "ojt_operations_framework",
        "patterns": [
          "What is Executive Order No. 23, s. 2023 about?",
          "Tell me about the On-the-Job Training (OJT) Operations and Frameworks at IFSU.",
          "How does IFSU protect students during OJT?"
        ],
        "responses": [
          "Executive Order No. 23, s. 2023 adopted and implemented the University’s On-the-Job Training (OJT) Operations and Frameworks, approved by the Board of Regents through BOR Resolution No. 120, s. 2019. This framework ensures that students are protected from harassment, exploitation, and poor training conditions, aligning with the University’s ethical standards and supporting safe and constructive internship experiences."
        ]
      },
      {
        "tag": "quality_policy",
        "patterns": [
          "What is the IFSU Quality Policy?",
          "Tell me about IFSU's commitment to quality management.",
          "What is IFSU's approach to maintaining international quality standards?"
        ],
        "responses": [
          "The IFSU Quality Policy is based on a commitment to international quality standards and a continuous improvement approach in effective quality management systems. This commitment aims to deliver excellent administrative services, instruction, research, extension, training services, and resource generation to ensure client satisfaction."
        ]
      },
      {
        "tag": "quality_objectives",
        "patterns": [
          "What are IFSU's quality objectives?",
          "Can you list IFSU's quality objectives?",
          "What goals does IFSU have for maintaining quality?"
        ],
        "responses": [
          "IFSU's quality objectives include:<br>a. Achieving 100% client satisfaction ratings.<br>b. Maintaining an 80% budget utilization rate for obligation.<br>c. Maintaining an 80% budget utilization rate for disbursement.<br>d. Implementing 30% of compliance measures from previous audit findings.<br>e. Subjecting 50% of the value of goods and services (based on NEP) to early procurement.<br>f. Attending 300 hours of relevant international training and seminars by faculty and staff.<br>g. Attending 1500 hours of relevant national and regional training and seminars by faculty and staff.<br>h. Refurbishing or upgrading 65% of existing facilities.<br>i. Allocating 5% of funds to Gender and Development (GAD) Programs, Projects, and Activities (PPAs).<br>j. Ensuring on-time submission of various documents and reports to agencies and offices."
        ]
      },
      {
        "tag": "about_ifsu_giahs_center",
        "patterns": [
          "Tell me about the IFSU GIAHS Center.",
          "What is the IFSU GIAHS Center?",
          "Explain the IFSU GIAHS Center.",
          "What does the IFSU GIAHS Center do?"
        ],
        "responses": [
          "The Center for the Ifugao Rice Terraces as a Globally Important Agricultural Heritage Systems (GIAHS) was established by Policy – Guidelines No. 66 – 2014 on January 19, 2015, approved by the Board of Regents through Resolution No. 451 s. 2014. It is part of the university's organizational structure and focuses on conservation and revitalization projects related to the Ifugao Rice Terraces.<br><br>The Center undertakes research, extension activities, cultural restoration, and documentation of indigenous systems and technologies.<br><br>The Center implements four main components:<br><br>1. **International Innovation Center for Indigenous Studies**: Facilitates innovation and knowledge co-creation through research, resource development, and data management.<br>2. **Capacity Building Programs**: Offers training programs like the Ifugao Satoyama Meister Training Program and Ifugao Indigenous Knowledge Educators Training Program to support the conservation of the terraces and indigenous knowledge education.<br>3. **Heritage Resource Center**: Maintains a library of resources on Ifugao heritage and publishes materials like the GIAHS Bulletin to promote knowledge.<br>4. **Local and International Linkages**: Strengthens partnerships for collaborative research and heritage conservation with local and international communities.<br><br>The Ifugao Rice Terraces were designated a GIAHS site by the UN FAO in 2011 and a World Heritage Site by UNESCO in 1995. They exemplify a satoyama-like socio-ecological landscape that integrates human and natural elements for sustainable development."
        ]
      }
    ]
  }
